OpenFOAM-13/tutorials/multiRegion/film/rivuletBox/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh -region box

runApplication -s panel extrudeToRegionMesh \
    -dict system/extrudeToRegionMeshDict.panel \
    -region box

runApplication -s film extrudeToRegionMesh \
    -dict system/extrudeToRegionMeshDict.film \
    -region panel

# Add the coupling between box and film
# Third-region coupling is not currently supported by extrudeToRegionMesh

runApplication -s box foamDictionary -set \
    "entry0/film/type=mappedExtrudedWall, \
     entry0/film/neighbourRegion=film, \
     entry0/film/neighbourPatch=surface, \
     entry0/film/isExtrudedRegion=no" \
     constant/box/polyMesh/boundary

runApplication -s film foamDictionary -set \
    "entry0/surface/type=mappedFilmSurface, \
     entry0/surface/neighbourRegion=box, \
     entry0/surface/neighbourPatch=film, \
     entry0/surface/isExtrudedRegion=yes" \
     constant/film/polyMesh/boundary

printf "\n%s\n" "Creating files for paraview post-processing"
paraFoam -touchAll
echo

# Serial run
#runApplication foamMultiRun

# Parallel run
runApplication decomposePar -allRegions
runParallel foamMultiRun
runApplication reconstructPar -allRegions

#------------------------------------------------------------------------------
